{
    "animation_color_battery_to_house": "color de la animación entre la batería y la casa (predeterminado: vacío)",
    "animation_color_grid_to_battery": "color de la animación entre cuadrícula y batería (predeterminado: vacío)",
    "animation_color_grid_to_house": "color de la animación entre cuadrícula y casa (predeterminado: vacío)",
    "animation_color_house_to_car": "color de la animación entre casa y coche (predeterminado: vacío)",
    "animation_color_house_to_custom": "color de la animación entre la casa y el círculo personalizado (predeterminado: vacío)",
    "animation_color_solar_to_battery": "color de la animación entre la producción solar y la batería (predeterminado: vacío)",
    "animation_color_solar_to_grid": "color de la animación entre la producción solar y la red (predeterminado: vacío)",
    "animation_color_solar_to_house": "color de la animación entre la producción solar y la casa (predeterminado: vacío)",
    "battery": "batería",
    "battery_charge": "batería Carga y descarga",
    "battery_charge_state": "Cargar batería:",
    "battery_discharge": "Descargar batería:",
    "battery_percent": "nivel de batería:",
    "car": "coche",
    "car_battery_charge": "Estado del nivel de la batería del coche:",
    "car_charge": "coche de carga",
    "car_charge_energy": "caja de empotrar o cargador:",
    "car_plugged": "cargador de coche enchufado:",
    "cb_battery_different": "Use diferentes estados para la carga y descarga de la batería",
    "cb_battery_reverse": "Use negativo para cargar <u>y</u> positivo para descargar",
    "cb_calculate_consumption": "Cálculo de Consumo vía 'Producción' + 'Grid'",
    "cb_circle_shadow": "Mostrar sombra alrededor de los círculos",
    "cb_consumption_reverse": "El consumo es negativo",
    "cb_grid_all_positive": "Usar positivo para consumo <u>y</u> positivo para alimentación a red en",
    "cb_grid_different": "Utilice diferentes estados para la alimentación y el consumo de la red.",
    "cb_grid_reverse": "Usar positivo para consumo <u>y</u> negativo para alimentación de red",
    "circle": "circulo",
    "circle_size": "Grosor del contorno del círculo (en px)",
    "color-settings": "ajustes de color",
    "color_animation": "color de la animación en las líneas (predeterminado: #ffce4a)",
    "color_battery": "color del círculo alrededor de la batería (predeterminado: #a1d343)",
    "color_battery_percent": "color del texto % dentro del círculo de la batería (predeterminado: #a1d343)",
    "color_battery_text": "color del texto dentro del círculo del auto (predeterminado: #a1d343)",
    "color_battery_to_house": "color de la línea entre la batería y la casa (predeterminado: vacío)",
    "color_car": "color del círculo alrededor del coche (predeterminado: #c5902e)",
    "color_car_percent": "color del texto % dentro del círculo del automóvil (predeterminado: #c5902e)",
    "color_car_plugged": "color del icono del coche si el cargador está conectado (predeterminado: #a1d343)",
    "color_car_text": "color del texto dentro del círculo del auto (predeterminado: #c5902e)",
    "color_custom": "color del círculo alrededor del círculo personalizado (predeterminado: #f20e40)",
    "color_custom_text": "color del texto dentro del círculo personalizado (predeterminado: #f20e40)",
    "color_grid": "color del círculo alrededor de la alimentación de la cuadrícula (predeterminado: #61687a)",
    "color_grid_text": "color del texto dentro del círculo de la red de alimentación (predeterminado: #61687a)",
    "color_grid_to_battery": "color de la línea entre la red y la batería (predeterminado: vacío)",
    "color_grid_to_house": "color de la línea entre la cuadrícula y la casa (predeterminado: vacío)",
    "color_house": "color del círculo alrededor de la casa (predeterminado: #00b5dd)",
    "color_house_text": "color del texto dentro del círculo de la casa (predeterminado: #00b5dd)",
    "color_house_to_car": "color de la línea entre casa y coche (predeterminado: vacío)",
    "color_house_to_custom": "color de la línea entre la casa y el círculo personalizado (predeterminado: vacío)",
    "color_lines": "color de las líneas (por defecto: #000000)",
    "color_production": "color del círculo alrededor de la producción solar (predeterminado: #ffce4a)",
    "color_production_text": "color del texto dentro del círculo de la producción solar (predeterminado: #ffce4a)",
    "color_solar_to_battery": "color de la línea entre la producción solar y la batería (predeterminado: vacío)",
    "color_solar_to_grid": "color de la línea entre la producción solar y la red (predeterminado: vacío)",
    "color_solar_to_house": "color de la línea entre la producción solar y la casa (predeterminado: vacío)",
    "consumption": "consumo:",
    "custom": "círculo personalizado",
    "custom_icon": "icono dentro del círculo personalizado:",
    "custom_label": "etiqueta dentro del círculo personalizado:",
    "custom_title": "círculo personalizado:",
    "energiefluss adapter settings": "Configuración del adaptador para energiefluss",
    "ex_battery_charge": "Punto de datos para cargar la batería <br><br>(Esta suele ser una condición negativa y positiva. Si el estado es diferente, marque la casilla y especifique el otro estado en)",
    "ex_battery_discharge": "Punto de datos para descargar su batería",
    "ex_battery_percent": "punto de datos del nivel de carga de su batería en %",
    "ex_car_battery": "Punto de datos de su coche accu en %",
    "ex_car_charge": "Punto de datos de su cargador o wallbox",
    "ex_car_plugged": "Cargador de coche de punto de datos enchufado",
    "ex_consumption": "Punto de datos del consumo de tu casa",
    "ex_custom": "Punto de datos de su círculo personalizado",
    "ex_custom_icon1": "¿Cómo obtener el icono?<br>(Visite <a href='https://materialdesignicons.com' target='_blank'>https://materialdesignicons.com</a> y busque un icono.",
    "ex_custom_icon2": "Haga clic en el ícono y en la fila de abajo, haga clic en '<b>< / ></b>', elija 'Ver SVG' y copie solo el texto dentro de <b>d</b>.",
    "ex_custom_icon3": "Si lo ingresó correctamente, reemplazará el ícono de signo de interrogación actual a continuación.",
    "ex_custom_preview": "Avance",
    "ex_fraction": "Si es cero, el valor se redondeará al siguiente entero posible.",
    "ex_grid_consumption": "Punto de datos de su consumo de red",
    "ex_grid_feed": "Punto de datos de su alimentador de red<br><br>(Esta suele ser una condición negativa y positiva. Si el estado es diferente, marque la casilla y especifique el otro estado)",
    "ex_house_netto": "Restar el consumo del coche y equipamiento adicional del consumo de la casa",
    "ex_production": "Punto de datos de su producción fotovoltaica",
    "ex_unit": "Unidad (W o kW) para mostrar",
    "fill_color_battery": "color dentro del círculo de la batería (predeterminado: vacío)",
    "fill_color_car": "color dentro del círculo del coche (predeterminado: vacío)",
    "fill_color_custom": "color dentro del círculo personalizado (predeterminado: vacío)",
    "fill_color_grid": "color dentro del círculo de la cuadrícula (predeterminado: vacío)",
    "fill_color_house": "color dentro del círculo de la casa (predeterminado: vacío)",
    "fill_color_production": "color dentro del círculo de la producción solar (predeterminado: vacío)",
    "font": "fuente",
    "font-and-line": "fuente y línea",
    "font-for-all": "font-face para todos los elementos: si se especifica la URL a la derecha, defina el alias aquí (predeterminado: sans-serif)",
    "font-src": "url de fuente relativa<br>¡Solo se permiten rutas (relativas) desde la misma IP o dirección! ",
    "font_size": "tamaño de fuente",
    "font_size_label": "tamaño de fuente de la descripción dentro del círculo (en px)",
    "font_size_percent": "tamaño de fuente del valor porcentual dentro del círculo (en px)",
    "font_size_value": "tamaño de fuente del valor dentro del círculo (en px)",
    "fraction": "Número de lugares después del punto decimal",
    "grid": "cuadrícula",
    "grid feed in settings": "Alimentación a red y consumo de red",
    "grid_consuming": "Estado de consumo de red",
    "grid_consumption": "Consumo de red:",
    "grid_feed": "Alimentación de red:",
    "house": "casa",
    "house_netto": "Mostrar el consumo neto de la casa",
    "line": "línea",
    "line_desc": "Aquí puede modificar cada línea y animación entre los círculos. ",
    "line_size": "Tamaño de la línea (en px)",
    "lines": "líneas",
    "lines_and_animations": "lineas y animaciones",
    "other": "Otro",
    "production": "producción solar",
    "production and consuming": "producción y uso",
    "recalculate": "Calcular valores de W en kW",
    "reset_colors_to_default": "Restablecer todos los colores a los predeterminados",
    "special_lines": "líneas especiales y animaciones",
    "unit": "unidad:"
}
