{
  "common": {
    "name": "energiefluss",
    "version": "2.1.0",
    "news": {
      "2.1.0": {
        "en": "extended opacity from icon, text and line to all elements",
        "de": "erweiterte opazität von symbol, text und zeile zu allen elementen",
        "ru": "расширенная непрозрачность от иконки, текста и строки до всех элементов",
        "pt": "opacidade estendida do ícone, texto e linha para todos os elementos",
        "nl": "verlengde opaciteit van icoon, tekst en lijn naar alle elementen",
        "fr": "opacité étendue de l'icône, du texte et de la ligne à tous les éléments",
        "it": "opacità estesa da icona, testo e linea a tutti gli elementi",
        "es": "opacidad extendida de icono, texto y línea a todos los elementos",
        "pl": "rozciągnął się od ikon, tekstu i linii do wszystkich elementów",
        "uk": "розширена опазія з ікони, тексту та лінії до всіх елементів",
        "zh-cn": "a. 从icon、案文和线扩大到所有要素"
      },
      "2.0.2": {
        "en": "small layout fix in admin area",
        "de": "kleine layout fix im admin-bereich",
        "ru": "небольшой верстка в админ-зоне",
        "pt": "pequena correção de layout na área de admin",
        "nl": "kleine schuilplaats in administratie",
        "fr": "petite mise en page fixe dans la zone admin",
        "it": "piccolo layout fix in area di amministrazione",
        "es": "pequeño diseño fijado en el área de administración",
        "pl": "niewielki układ w obszarze adminowym",
        "uk": "невелика фіксація макета в адмін зоні",
        "zh-cn": "专区小布局"
      },
      "2.0.1": {
        "en": "calculation Bug fixed",
        "de": "berechnung Fehler behoben",
        "ru": "расчет Bug фиксированный",
        "pt": "cálculo Bug corrigido",
        "nl": "calculatie Bug gemaakt",
        "fr": "calcul Bug corrigé",
        "it": "calcolo Bug fisso",
        "es": "cálculo Error fijo",
        "pl": "obliczanie Bug",
        "uk": "розрахунок Виправлено помилку",
        "zh-cn": "计算 Bug 固定"
      },
      "2.0.0": {
        "en": "Added 6 more Elements. Overall 10 are available now\nremoved \"house netto consumption for all elements\"\nadded option to subtract each element from house consumption\nadded \"Position\" in Elements. Now its possible, to Realign texts, values, icons, percentages and battery text (higher or lower)\nremoved battery animation for (dis-)/charging via Javascript\nadded battery animation via CSS\nlower memory usage due to drawing only necessary elements\nfixed Translations Errors\nsome code optimizations",
        "de": "6 weitere Elemente hinzugefügt. Insgesamt 10 sind jetzt verfügbar\nentfernt \"hausnetzverbrauch für alle elemente\"\nzusätzliche möglichkeit, jedes element vom hausverbrauch zu subtrahieren\nhinzugefügt Position in Elements. Jetzt ist es möglich, Texte, Werte, Icons, Prozente und Batterietext (höher oder niedriger) neu auszurichten\nentfernte Akku-Animation für (dis-)/Ladung über Javascript\nakku-Animation über CSS\ngeringere speichernutzung durch zeichnung nur notwendiger elemente\nfeste Übersetzungen Fehler\neinige codeoptimierungen",
        "ru": "Добавлено еще 6 элементов. Всего 10 доступно сейчас\nудалили \"потребление домашнего нетто для всех элементов\"\nдобавлена возможность вычитать каждый элемент из потребления дома\nдобавлена позиция в Elements. Теперь его возможно, чтобы Realign тексты, ценности, иконки, проценты и текст батареи (выше или ниже)\nудалена анимация батареи для (dis-) / зарядка через Javascript\nдобавлена анимация батареи через CSS\nболее низкое использование памяти из-за рисования только необходимых элементов\nфиксированные переводы Ошибок\nнекоторые оптимизации кода",
        "pt": "Adicionado 6 mais Elementos. No geral 10 estão disponíveis agora\nremoveu o \"consumo interno para todos os elementos\"\nopção adicionada para subtrair cada elemento do consumo de casa\nposição adicionada em Elementos. Agora é possível, para textos, valores, ícones, percentagens e texto da bateria (mais alto ou menor)\nanimação de bateria removida para (dis-) / carregamento via Javascript\nadicionado animação da bateria via CSS\nmenor uso de memória devido ao desenho apenas elementos necessários\nerros de Traduções Fixas\nalgumas otimizações de código",
        "nl": "Zes extra Elements toegevoegd. Overal 10 is nu beschikbaar\nverwijderde netto consumptie voor alle elementen\nvoegde optie om elk element van huisconsumptie in te trekken\nvoegde Positie toe in Elements. Nu is het mogelijk, naar Realign sms'jes, waarden, icoons, percentages en batterij tekst (higher or lower)\nverwijderde batterij animatie voor (dis)/charing via Javascript\nvoegde accu animatie toe via CSS\neen lager geheugengebruik door alleen noodzakelijke elementen te tekenen\nvertaling:\nwat code optimaties",
        "fr": "Ajouté 6 autres Éléments. Dans l'ensemble, 10 sont disponibles maintenant\n\"la consommation de netto pour tous les éléments\"\noption ajoutée pour soustraire chaque élément de la consommation de maison\najouté Position dans Elements. Maintenant son possible, pour réaligner les textes, les valeurs, les icônes, les pourcentages et le texte de la batterie (plus haut ou plus bas)\nanimation de batterie supprimée pour (dis-)/charging via Javascript\nanimation de batterie ajoutée via CSS\nfaible utilisation de la mémoire en raison de ne dessiner que les éléments nécessaires\nerreurs de Traductions fixes\nquelques optimisations de code",
        "it": "Aggiunto 6 più Elementi. Nel complesso 10 sono disponibili ora\nrimosso \"consumo netto casa per tutti gli elementi\"\nopzione aggiunta per sottrarre ogni elemento dal consumo di casa\naggiunto Posizione in Elementi. Ora è possibile, per Realizzare testi, valori, icone, percentuali e testo della batteria (più alto o più basso)\nrimosse l'animazione della batteria per (dis-)/carica tramite Javascript\nanimazione batteria aggiuntiva tramite CSS\nutilizzo della memoria inferiore a causa di disegno solo elementi necessari\ntraduzione fissa Errori\nalcune ottimizzazioni di codice",
        "es": "Se agregaron 6 elementos más. Total 10 están disponibles ahora\neliminado \"consumo de netto de casa para todos los elementos\"\nopción agregada para restar cada elemento del consumo de la casa\nañadido Posición en Elementos. Ahora es posible, a textos, valores, iconos, porcentajes y texto de batería (más alto o más bajo)\nanimación de la batería eliminada para (dis-)/charging via Javascript\nañadida animación de la batería vía CSS\nmenor uso de memoria debido al dibujo sólo elementos necesarios\ntraducción fija Errores\nalgunas optimizaciones de código",
        "pl": "Dodał 6 części. Obecnie jest już 10\nusunięte zużycie netto dla wszystkich elementów”\ndokładna opcja polega na odjęciu każdego elementu z konsumpcji domów\npozycja w elementach. Teraz jest możliwe, aby tworzyć teksty, wartości, ikony, odsetki i tekst baterii (wyższy lub niższy)\nusunięta animacja (dis-)/ ładowanie przez Javascript\ndodarzenie baterii przez CSS\nniższa pamięć z powodu rysowania jedynie niezbędnych elementów\nprzepisy stały\noptymalizacja kodu",
        "uk": "Додано ще 6 елементів. Всього 10 тепер\nвидаліть \"витрата чистоти для всіх елементів\"\nдоданий варіант для відрахування кожного елемента від споживання будинку\nдодана позиція в елементах. Тепер його можливо, щоб Вирівняти тексти, значення, іконки, проценти і текст батареї (високий або нижній)\nвидалена анімація акумулятора для (диск-)/закінчення через Javascript\nдодано анімацію акумулятора за допомогою CSS\nвикористання нижчої пам'яті за рахунок малювання тільки необхідні елементи\nвиправлені помилки перекладу\nдеякі оптимізації коду",
        "zh-cn": "增加6个要素。 总的10个现可提供\n删除“所有要素的净消费”\n增加将每个因素从房屋消费中逐出去的选择。\n要件中增添了立场。 如今,它有可能获取案文、价值、背景、百分比和电池票文本(较高或较低)。\n删除(区分)/通过贾瓦的电池\n通过CSS的新增电池\n由于仅用必要的要素而使用较低的记忆\n固定翻译\n某些守则的优化"
      },
      "1.3.0": {
        "en": "Added possibility, to configure the first custom element as car charge element with same attributes like normal car charge\nfixed a calculation issue",
        "de": "Zusätzliche Möglichkeit, das erste benutzerdefinierte Element als Autoladeelement mit gleichen Attributen wie normale Autoladung zu konfigurieren\neine berechnungsfrage behoben",
        "ru": "Добавлена возможность, чтобы настроить первый пользовательский элемент как элемент зарядки автомобиля с такими же атрибутами, как нормальный заряд автомобиля\nисправлена проблема расчета",
        "pt": "Adicionado possibilidade, para configurar o primeiro elemento personalizado como elemento de carga do carro com os mesmos atributos como carga normal do carro\nfixou um problema de cálculo",
        "nl": "Toegevoegd de mogelijkheid, om het eerste gebruikelijke element te bekrachtigen als auto-aanklacht met dezelfde attributen als normale autolading\neen berekeningsprobleem opgelost",
        "fr": "Ajout de la possibilité de configurer le premier élément personnalisé comme élément de charge de voiture avec les mêmes attributs que la charge de voiture normale\nfixe un problème de calcul",
        "it": "Aggiunta possibilità, per configurare il primo elemento personalizzato come elemento carica auto con gli stessi attributi come normale carica auto\nrisolto un problema di calcolo",
        "es": "Posibilidad agregada, para configurar el primer elemento personalizado como elemento de carga del coche con los mismos atributos como carga normal del coche\nfija un problema de cálculo",
        "pl": "Wstępna możliwość skonfigurowania pierwszego zwyczajowego elementu jako elementu ładowania samochodu z tymi samymi atrybutami, jak normalny ładunek samochodowy\nustalona kwestia obliczeniowa",
        "zh-cn": "增加可能性,将第一种习俗要素与正常汽车收费等同属性要素进行配置\n固定的计算问题",
        "uk": "Додана можливість налаштувати перший користувацький елемент як елемент зарядки автомобіля з такими ж атрибутами, як і звичайний заряд автомобіля\nвиправлено проблему розрахунку"
      },
      "1.2.1": {
        "en": "Color and font-size of battery-remaining time changeable\nColor of all icons changeable (one color for all icons)",
        "de": "Farbe und Schriftgröße der Akkulaufzeit wechselbar\nFarbe aller Icons änderbar (eine Farbe für alle Icons)",
        "ru": "Цвет и размер шрифта аккумулятора, сохраняя время переменчиво\nЦвет всех икон переменчивых (один цвет для всех иконок)",
        "pt": "Cor e tamanho da fonte do tempo de substituição da bateria\nCor de todos os ícones mutáveis (uma cor para todos os ícones)",
        "nl": "Kleur en font-size van batterij-veranderingstijd\nDe kleur van alle icoons veranderen in één kleur voor alle iconen",
        "fr": "Couleur et taille de police de la batterie-mainmaining time changeable\nCouleur de toutes les icônes changeables (une couleur pour toutes les icônes)",
        "it": "Colore e dimensione del carattere del tempo di mantenimento della batteria\nColore di tutte le icone modificabili (un colore per tutte le icone)",
        "es": "Color y tamaño de fuente de cambio de tiempo que se mantiene\nColor de todos los iconos cambiables (un color para todos los iconos)",
        "pl": "Kolor i czcionka z upływem czasu zmieniają się\nKolor wszystkich ikon zmienia się (jeden kolor dla wszystkich ikon)",
        "zh-cn": "A. 电池和电池的制剂\n一切可改变的理由(所有神秘的颜色)",
        "uk": "Колір і розмір шрифту часу, що залишився, можна змінювати\nКолір усіх значків змінюється (один колір для всіх значків)"
      },
      "1.2.0": {
        "en": "Added text for Battery Remaining. Shows the remaining charge or discharge time (battery-capacity and datapoint for battery-percent need to be provided)\ncorrected Error \"Cannot parse JSON: undefined\"\nfixed some translations",
        "de": "Text hinzugefügt für Battery Remaining. Zeigt die verbleibende Lade- oder Entladezeit (Batterie-Kapazität und Datenpunkt für Batterieprozent)\nkorrigierter Fehler \"Cannot parse JSON: undefiniert\"\neinige übersetzungen",
        "ru": "Добавлен текст для батареи Осталось. Показывает оставшееся время заряда или разрядки (батареи-капкость и дата-точка для батареи-процентной необходимости быть обеспечены)\nисправлена ошибка \"Cannot parse JSON: undefined\"\nисправили некоторые переводы",
        "pt": "Texto adicionado para restante da bateria. Mostra o tempo restante de carga ou descarga (capacidade de bateria e datapoint para necessidade de bateria por cento ser fornecido)\nerro corrigido \"Não é possível analisar JSON: indefinido\"\nfixo algumas traduções",
        "nl": "Vermeld tekst voor Battery Remining. Toont de resterende aanklacht of ontlading tijd (batterij-capaciteit en datapoint voor accu-percente behoefte om te worden verstrekt)\nvertaling:\nvertaling:",
        "fr": "Ajout du texte pour Battery Remaining. Affiche le temps de charge ou de décharge restant (capacité de réduction et point de données pour le pourcentage de batterie doit être fourni)\nerreur corrigée \"Cannot parse JSON: undefined\"\ncorrection de quelques traductions",
        "it": "Aggiunto il testo per il mantenimento della batteria. Mostra il tempo di carica rimanente o di scarico (la capacità di batteria e il datapoint per la batteria-percentuale devono essere forniti)\nerrore corretto \"Cannot parse JSON: non definito\"\nfisso alcune traduzioni",
        "es": "Texto añadido para Bateria Permaneciendo. Muestra el tiempo de carga o descarga restante (capacidad de batería y punto de datos para la batería por ciento necesita ser proporcionado)\nerror corregido \"No puede parse JSON: indefinido\"\nfijo algunas traducciones",
        "pl": "Strona dodana do Battery Remaining. Pokazuje pozostałe czasy ładowania lub wyładowania (kondensacja baterii i punkt danych dla potrzebujących baterii)\nerror „Cannot parse JSON: undefiniowane”\nustalono kilka tłumaczeń",
        "zh-cn": "增加Battery Remaining案文。 需提供剩余费用或排放时间(需要为电池中心提供易燃能力和数据点)\n更正的Error “Cannot parse JSON:未界定”\n固定翻译",
        "uk": "Додано текст для залишку заряду батареї. Показує час заряду або розряду, що залишився (потрібно вказати ємність батареї та дані для відсотка батареї)\nвиправлено помилку «Не вдається розібрати JSON: undefined»\nвиправлено деякі переклади"
      }
    },
    "titleLang": {
      "en": "Energiefluss",
      "de": "Energiefluss",
      "ru": "Энергифлусс",
      "pt": "Energiefluss",
      "nl": "Energiefluss",
      "fr": "Energiefluss",
      "it": "Flusso di energia",
      "es": "Energiefluss",
      "pl": "Energiefluss",
      "zh-cn": "精力充沛",
      "uk": "Енергієзлив"
    },
    "desc": {
      "en": "It provides an animated energy-flow for solar-panels, battery-charging, house-consumption, grid feed-in and car-charging.",
      "de": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "ru": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pt": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "nl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung en Auto-Ladung bereit.",
      "fr": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "it": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung beit.",
      "es": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "zh-cn": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit。",
      "uk": "Він забезпечує анімований потік енергії для сонячних панелей, заряджання акумулятора, домашнього споживання, підключення до мережі та заряджання автомобіля."
    },
    "authors": [
      "SKB <info@skb-web.de>"
    ],
    "keywords": [
      "energy",
      "energy-flow",
      "energie",
      "energiefluss"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "energiefluss.png",
    "enabled": true,
    "localLink": "%web_protocol%://%ip%:%web_port%/energiefluss/index.html?instance=%instance%",
    "extIcon": "https://raw.githubusercontent.com/SKB-CGN/ioBroker.energiefluss/main/admin/energiefluss.png",
    "readme": "https://github.com/SKB-CGN/ioBroker.energiefluss/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "materialize": true,
    "materializeTab": true,
    "adminTab": {
      "singleton": false,
      "name": {
        "en": "Energiefluss",
        "de": "Energiefluss",
        "ru": "Энергифлусс",
        "pt": "Energiefluss",
        "nl": "Energiefluss",
        "fr": "Energiefluss",
        "it": "Flusso di energia",
        "es": "Energiefluss",
        "pl": "Energiefluss",
        "zh-cn": "精力充沛"
      },
      "link": "",
      "fa-icon": "info"
    },
    "supportCustoms": false,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ]
  },
  "native": {
    "battery_animation": true,
    "battery_reverse": false,
    "element_size": 2,
    "element_shadow": true,
    "element_shadow_color": "rgba(0, 0, 0, .7)",
    "color_animation": "#ffce4a",
    "color_battery": "#a1d343",
    "color_battery_percent": "#a1d343",
    "color_battery_text": "#a1d343",
    "color_car": "#c5902e",
    "color_car_percent": "#c5902e",
    "color_car_plugged": "#a1d343",
    "color_car_text": "#c5902e",
    "color_label": "#000000",
    "color_custom0": "#f20e40",
    "color_custom0_text": "#f20e40",
    "color_custom1": "#f20e40",
    "color_custom1_text": "#f20e40",
    "color_custom2": "#f20e40",
    "color_custom2_text": "#f20e40",
    "color_custom3": "#f20e40",
    "color_custom3_text": "#f20e40",
    "color_custom4": "#f20e40",
    "color_custom4_text": "#f20e40",
    "color_custom5": "#f20e40",
    "color_custom5_text": "#f20e40",
    "color_custom6": "#f20e40",
    "color_custom6_text": "#f20e40",
    "color_custom7": "#f20e40",
    "color_custom7_text": "#f20e40",
    "color_custom8": "#f20e40",
    "color_custom8_text": "#f20e40",
    "color_custom9": "#f20e40",
    "color_custom9_text": "#f20e40",
    "color_grid": "#61687a",
    "color_grid_text": "#61687a",
    "color_house": "#00b5dd",
    "color_house_text": "#00b5dd",
    "color_lines": "#000000",
    "color_production": "#ffce4a",
    "color_production_text": "#ffce4a",
    "consumption_reverse": false,
    "font": "sans-serif",
    "font_size_label": 12,
    "font_size_percent": 14,
    "font_size_value": 14,
    "font_size_unit": 14,
    "font_size_unit_percent": 14,
    "font_size_remaining": 14,
    "grid_all_positive": false,
    "grid_reverse": false,
    "line_size": 4,
    "element_type": "circle",
    "rect_height": 100,
    "rect_width": 100,
    "rect_corner": 15,
    "recalculate": false,
    "unit": "kW",
    "fraction": 2,
    "animation_dots": 3,
    "animation_distance": 12,
    "animation_length": 4,
    "animation_width": 8,
    "animation_duration": 2000,
    "animation_linecap": "round",
    "animation": "4 12 4 12 4 100",
    "fraction_battery": 0,
    "house_netto_car": false,
    "house_netto_custom0": false,
    "house_netto_custom1": false,
    "house_netto_custom2": false,
    "house_netto_custom3": false,
    "house_netto_custom4": false,
    "house_netto_custom5": false,
    "house_netto_custom6": false,
    "house_netto_custom7": false,
    "house_netto_custom8": false,
    "house_netto_custom9": false,
    "label_house": "Verbrauch",
    "label_grid": "Netz",
    "label_battery": "Batterie",
    "label_battery_remaining": "Restzeit",
    "label_production": "Erzeugung",
    "label_car": "Auto",
    "battery_capacity_info": false,
    "color_battery_remain": "#000000",
    "color_icon": "#000000",
    "custom_type": "consumer",
    "color_car_custom_plugged": "#a1d343",
    "color_car_custom_percent": "#f20e40",
    "offset_icon": 0,
    "offset_text": 0,
    "offset_value": 0,
    "offset_percent": 0,
    "offset_remaining": 0,
    "opacity_icon": 70,
    "opacity_text": 70,
    "opacity_value": 70,
    "opacity_percent": 70,
    "opacity_remaining": 70,
    "opacity_line": 70
  },
  "objects": [],
  "instanceObjects": []
}
