{
  "common": {
    "name": "energiefluss",
    "version": "1.0.6",
    "news": {
      "1.0.6": {
        "en": "If consumption is negative, this was not displayed\nElements can now be selected (rectangle or circle)\nThreshold for the user-defined elements was not always adopted\nIncreased number of animation points to 5\nData point load reduced by 90%, as the configuration is now only loaded when it starts or changes (previously when the values changed)\nIcons are realigned when resizing the element\nCleaned up the admin interface",
        "de": "Wenn der Verbrauch negativ ist, wurde dies nicht angezeigt\nElemente können nun ausgewählt werden (Rectangle oder Kreis)\nSchwelle für die benutzerdefinierten Elemente wurde nicht immer angenommen\nErhöhte Anzahl von Animationspunkten auf 5\nDatenpunktbelastung um 90,% reduziert, da die Konfiguration jetzt nur dann geladen wird, wenn sie beginnt oder ändert (vorher, wenn die Werte geändert werden)\nIcons werden beim Resizing des Elements neu ausgerichtet\nDie Admin-Schnittstelle gereinigt",
        "ru": "Если потребление отрицательное, то это не отображалось\nЭлементы теперь можно выбрать (ректугольник или круг)\nПорог для пользовательских элементов не всегда был принят\nУвеличение числа анимационных точек до 5\nНагрузка точки данных сократилась на 90,%, поскольку конфигурация сейчас загружается только при запуске или изменениях (ранее, когда изменения значения)\nИконки реализуются при воспроизведении элемента\nОчищен админ интерфейс",
        "pt": "Se o consumo é negativo, isso não foi exibido\nElementos podem agora ser selecionados (retângulo ou círculo)\nO limiar para os elementos definidos pelo usuário nem sempre foi adotado\nAumento do número de pontos de animação para 5\nCarga de ponto de dados reduzida em 90,% como a configuração é agora apenas carregada quando começa ou muda (anteriormente quando os valores mudaram)\nÍcones são realinhados ao redimensionar o elemento\nLimpe a interface de administrador",
        "nl": "Als consumptie negatief is, is dit niet vertoond\nElements kan nu geselecteerd worden\nDreigen voor de gebruikers-definieer elementen was niet altijd geadopteerd\nVerhoogd aantal animatiepunten naar 5\nDatapunt verminderd door 90,% als de configuatie nu alleen geladen is als het begint of verandert wanneer de waarden veranderden\nIcons zijn geregistreerd als het element herschikken\nMaak de administratie interface schoon",
        "fr": "Si la consommation est négative, cela n'a pas été affiché\nLes éléments peuvent maintenant être sélectionnés (rectangle ou cercle)\nLe seuil pour les éléments définis par l'utilisateur n'a pas toujours été adopté\nAugmentation du nombre de points d'animation à 5\nCharge de point de données réduite de 90,% puisque la configuration est maintenant seulement chargée quand elle commence ou change (précédemment lorsque les valeurs ont changé)\nLes icônes sont réalignées lorsque l'élément est redimensionné\nNettoyer l'interface d'administration",
        "it": "Se il consumo è negativo, questo non è stato visualizzato\nGli elementi possono ora essere selezionati (rectangle o cerchio)\nLa soglia per gli elementi definiti dall'utente non è sempre stata adottata\nNumero aumentato di punti di animazione a 5\nCarico del punto di dati ridotto del 90,% in quanto la configurazione è ora caricata solo quando inizia o cambia (precedentemente quando i valori cambiati)\nLe icone sono riallineate quando ridimensionano l'elemento\nPulito l'interfaccia di amministrazione",
        "es": "Si el consumo es negativo, esto no fue mostrado\nAhora se pueden seleccionar elementos (rectángulo o círculo)\nNo siempre se adoptó el umbral para los elementos definidos por el usuario\nMayor número de puntos de animación a 5\nCarga de punto de datos reducida en 90,%, ya que la configuración ahora sólo se carga cuando comienza o cambia (antes cuando los valores cambiaron)\nLos iconos se reajustan al redimensionar el elemento\nLimpiar la interfaz de administración",
        "pl": "Jeśli zużycie jest ujemne, to nie było wyświetlane\nElementy mogą być obecnie wybrane (odwracanie lub koło)\nZawartość dla zdefiniowanych przez użytkownika elementów nie zawsze została przyjęta\nLiczba animacji wynosi do 5\nWskaźnik danych zmniejsza się o 90,%, jako że konfiguracja jest teraz załadowana, gdy rozpoczyna się lub zmienia (wcześniej gdy zmienione wartości)\nKonsekwencje są rezygnowane, gdy resygnuje element\nObjaśnienie interfejsu adminowego",
        "zh-cn": "如果消费是消极的,就不会出现这种消费。\n现在可以选定要素(原状或圈)。\n对用户界定要素的豁免并非总是通过。\n表5\n数据点减少了90.0%,因为组合现在只装在开始或改变(以前在价值观变化时)时。\n在重新调整该要素时,我对此表示赞同。\n清理专用接口"
      },
      "1.0.1": {
        "en": "cleaned up Admin-Interface\npossible, to choose objects via Object-Browser\ncorrected missing translations",
        "de": "bereinigt Admin-Interface\nmöglich, Objekte über Object-Browser auszuwählen\nkorrigierte fehlende übersetzungen",
        "ru": "очистить Admin-Interface\nвозможно, выбрать объекты через Object-Browser\nисправлены недостающие переводы",
        "pt": "limpar Admin-Interface\npossível, para escolher objetos via Object-Browser\ntraduções em falta corrigidas",
        "nl": "admin-Interface\nmogelijk om objecten te kiezen via Object-Browser\nvertaling:",
        "fr": "nettoyage Admin-Interface\npossible, choisir des objets via Object-Browser\ntraductions manquantes corrigées",
        "it": "pulire Admin-Interface\npossibile, scegliere oggetti tramite Object-Browser\ncorreggere le traduzioni mancanti",
        "es": "limpiado Admin-Interface\nposible, elegir objetos a través de Object-Browser\ncorregido traducciones faltantes",
        "pl": "czyścić Admin-Interface\nmożliwe jest wybór obiektów przez Object-Browser\npoprawić brak tłumaczeń",
        "zh-cn": "清洁水\n可能通过目标-Browser选择物体\n更正的缺失翻译"
      },
      "1.0.0": {
        "en": "added 3 more circles. Overall 4 are now possible and this will be the current maximum (all circles can be customized as well)\naligned the complete graphic to the left to save space on the height and right",
        "de": "3 weitere Kreise hinzugefügt. Insgesamt 4 sind jetzt möglich und dies wird das aktuelle Maximum sein (alle Kreise können auch angepasst werden)\ndie komplette grafik nach links ausgerichtet, um platz auf der höhe und rechts zu sparen",
        "ru": "добавлено еще 3 круга. В целом 4 теперь возможно, и это будет текущий максимум (все круги могут быть настроены также)\nвыровнена полная графика слева, чтобы сохранить пространство на высоте и справа",
        "pt": "adicionou mais 3 círculos. No geral 4 agora são possíveis e este será o máximo atual (todos os círculos podem ser personalizados também)\nalinhado o gráfico completo à esquerda para economizar espaço na altura e à direita",
        "nl": "nog drie cirkels toegevoegd. Meerdere vier zijn nu mogelijk en dit zal het huidige maximum zijn\nvertaling:",
        "fr": "ajouté 3 cercles de plus. Dans l'ensemble 4 sont maintenant possibles et ce sera le maximum courant (tous les cercles peuvent être personnalisés aussi)\naligner le graphique complet à gauche pour sauvegarder l'espace sur la hauteur et à droite",
        "it": "aggiunto 3 cerchi in più. Nel complesso 4 sono ora possibili e questo sarà il massimo attuale (tutti i cerchi possono essere personalizzati pure)\nallineato il grafico completo a sinistra per risparmiare spazio sull'altezza e a destra",
        "es": "agregó 3 círculos más. En general 4 son ahora posibles y este será el máximo actual (todos los círculos también se pueden personalizar)\nalinea el gráfico completo a la izquierda para ahorrar espacio en la altura y la derecha",
        "pl": "dodał jeszcze 3 okręgi. Prawie 4 {\\displaystyle 4} jest obecnie możliwe i będzie to aktualny maksymalny (wszystkie kręgi mogą być również dostosowane)\nwyrównał kompletną grafikę do lewej, aby uratować przestrzeń na wysokości i prawym skrzydle",
        "zh-cn": "增加了3个。 总的4个现在是可能的,这将是目前最大程度的(所有圈子都可以定制)\n完全图表与留在高空和右侧的空间相吻合"
      },
      "0.8.6": {
        "en": "color of the label inside the circle can be changed\nsmoother animation on slower devices\nnumber of animation dots selectable",
        "de": "farbe des etiketts im kreis kann geändert werden\nglattere animation auf langsameren geräten\nanzahl der animationspunkte wählbar",
        "ru": "цвет этикетки внутри круга можно изменить\nболее плавная анимация на более медленных устройствах\nколичество анимационных точек с выбором",
        "pt": "cor da etiqueta dentro do círculo pode ser alterado\nanimação mais suave em dispositivos mais lentos\nnúmero de pontos de animação selecionáveis",
        "nl": "de kleur van het label in de cirkel kan veranderen\ngladdere animatie op langzamere apparaten\ntal van animatie stippen selecteren",
        "fr": "couleur de l'étiquette à l'intérieur du cercle peut être changé\nanimation plus lisse sur des appareils plus lents\nnombre de points d'animation sélectionnables",
        "it": "colore dell'etichetta all'interno del cerchio può essere cambiato\nanimazione più liscia su dispositivi più lenti\nnumero di punti di animazione selezionabili",
        "es": "color de la etiqueta dentro del círculo se puede cambiar\nanimación más suave en dispositivos más lentos\nnúmero de puntos de animación seleccionable",
        "pl": "kolor wewnątrz kółka może być zmieniany\nsmooth animacja na wolniejszych urządzeniach\nliczba animacji do wyboru",
        "zh-cn": "可以改变圈内标签的颜色\n放慢装置的平稳\n若干可选择的植物"
      },
      "0.8.5": {
        "en": "if circle radius changed, adjust the new circles to appear correctly\nmoved percent element up for better layout",
        "de": "wenn sich der kreisradius geändert hat, die neuen kreise richtig einstellen\nbewegtes prozentelement nach oben für besseres layout",
        "ru": "если радиус круга изменился, правильно настроить новые круги\nпереместил элемент процента вверх для лучшего макета",
        "pt": "se o raio do círculo mudou, ajustar os novos círculos para aparecer corretamente\nmovido elemento de porcentagem para melhor layout",
        "nl": "als cirkel radius veranderde, de nieuwe cirkels aanpassen om correct te verschijnen\nquality over quantity (qoq) releases vertaling:",
        "fr": "si le rayon de cercle a changé, ajustez les nouveaux cercles pour apparaître correctement\ndéplacer l'élément pour cent vers le haut pour une meilleure mise en page",
        "it": "se il raggio del cerchio è cambiato, regolare i nuovi cerchi per apparire correttamente\nha spostato l'elemento per cento per una migliore disposizione",
        "es": "si el radio círculo cambió, ajustar los nuevos círculos para que aparezcan correctamente\nelemento movido hacia arriba para mejor diseño",
        "pl": "jeśli zmiana promienia okręgu, dostosowuje nowe kręgi do prawidłowego pojawiania się prawidłowo\nprzesunięcie % elementów w celu lepszego ustawienia",
        "zh-cn": "如果界线发生变化,调整新圈以正确的方式出现。\n调动了5%的要素,以更好地安排"
      },
      "0.8.4": {
        "en": "corrected house-consumption-calculation not working under some circumstances\npossibility to change circle radius",
        "de": "korrigierte hausverbrauchsrechnung nicht unter umständen\nmöglichkeit, kreisradius zu ändern",
        "ru": "исправлено размещение дома не работает при некоторых обстоятельствах\nвозможность изменения радиуса круга",
        "pt": "calculação de consumo de casa corrigida não trabalhando em algumas circunstâncias\npossibilidade de mudar o raio do círculo",
        "nl": "gecorrigeerde huis-consumptie berekeningen niet werken onder sommige omstandigheden\n_",
        "fr": "calcul corrigé de la consommation de maison ne fonctionnant pas dans certaines circonstances\npossibilité de changer de rayon de cercle",
        "it": "corretto calcolo della casa-consumo non funzionante in alcune circostanze\npossibilità di cambiare raggio cerchio",
        "es": "corregida casa-consumo-calculación no trabajando bajo algunas circunstancias\nposibilidad de cambiar el radio círculo",
        "pl": "poprawiona kalkulacja domowa nie działa w niektórych okolicznościach\nmożliwość zmiany promienia okręgu",
        "zh-cn": "b. 在某些情况下未工作的住房消费升级\nd. 改变中地层的可能性"
      },
      "0.8.3": {
        "en": "Correction of House-consumption calculation in combination with house-netto-calculation\nchanged battery animation if battery is fully charged or empty and no progress is detected",
        "de": "Korrektur der Hausverbrauchsberechnung in Kombination mit Haus-Netto-Berechnung\ngeänderte batterieanimation, wenn die batterie vollständig geladen oder leer ist und kein fortschritt erkannt wird",
        "ru": "Исправление расчетов House-consumption в комбинации с дома-нетто-расчётом\nизменена анимация батареи, если батарея полностью заряжена или пуста, и никакий прогресс не обнаружен",
        "pt": "Correção do cálculo do consumo doméstico em combinação com a casa-rede-calculação\nanimação de bateria alterada se a bateria estiver totalmente carregada ou vazia e nenhum progresso for detectado",
        "nl": "Vertaling:\nverandering van batterij animatie als batterij volledig wordt aangeklaagd of leeg en geen vooruitgang wordt ontdekt",
        "fr": "Correction du calcul de la consommation de maison en combinaison avec le calcul de l ' établissement d ' un réseau\nchangement d'animation de la batterie si la batterie est entièrement chargée ou vide et aucun progrès n'est détecté",
        "it": "Correzione del calcolo della casa-consumo in combinazione con la casa-netto-calcolo\nl'animazione della batteria modificata se la batteria è completamente carica o vuota e nessun progresso viene rilevato",
        "es": "Corrección del cálculo del consumo de la casa en combinación con el cálculo de la red de la casa\ncambiar la animación de la batería si la batería está completamente cargada o vacía y no se detecta progreso",
        "pl": "Wykorzystanie obliczeń z House’a w połączeniu z obliczeniami domowymi\nzmieniona animacja baterii, jeśli bateria jest w pełni naładowana lub pusta, nie wykrywa się żadnych postępów",
        "zh-cn": "B. 结合住房-网上图-提高住房消费计算\n如果电池被完全指控或空调,则电离破裂,发现没有进展。"
      }
    },
    "titleLang": {
      "en": "Energiefluss",
      "de": "Energiefluss",
      "ru": "Энергифлусс",
      "pt": "Energiefluss",
      "nl": "Energiefluss",
      "fr": "Energiefluss",
      "it": "Flusso di energia",
      "es": "Energiefluss",
      "pl": "Energiefluss",
      "zh-cn": "精力充沛"
    },
    "desc": {
      "en": "It provides an animated energy-flow for solar-panels, battery-charging, house-consumption, grid feed-in and car-charging.",
      "de": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "ru": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pt": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "nl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung en Auto-Ladung bereit.",
      "fr": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "it": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung beit.",
      "es": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "zh-cn": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit。"
    },
    "authors": [
      "SKB <info@skb-web.de>"
    ],
    "keywords": [
      "energy",
      "energy-flow",
      "energie",
      "energiefluss"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "energiefluss.png",
    "enabled": true,
    "localLink": "%web_protocol%://%ip%:%web_port%/energiefluss/index.html?instance=%instance%",
    "extIcon": "https://raw.githubusercontent.com/SKB-CGN/ioBroker.energiefluss/main/admin/energiefluss.png",
    "readme": "https://github.com/SKB-CGN/ioBroker.energiefluss/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "materialize": true,
    "materializeTab": true,
    "adminTab": {
      "singleton": false,
      "name": {
        "en": "Energiefluss",
        "de": "Energiefluss",
        "ru": "Энергифлусс",
        "pt": "Energiefluss",
        "nl": "Energiefluss",
        "fr": "Energiefluss",
        "it": "Flusso di energia",
        "es": "Energiefluss",
        "pl": "Energiefluss",
        "zh-cn": "精力充沛"
      },
      "link": "",
      "fa-icon": "info"
    },
    "supportCustoms": false,
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ]
  },
  "native": {
    "battery_animation": true,
    "battery_reverse": false,
    "element_size": 2,
    "element_shadow": true,
    "element_shadow_color": "rgba(0, 0, 0, .7)",
    "color_animation": "#ffce4a",
    "color_battery": "#a1d343",
    "color_battery_percent": "#a1d343",
    "color_battery_text": "#a1d343",
    "color_car": "#c5902e",
    "color_car_percent": "#c5902e",
    "color_car_plugged": "#a1d343",
    "color_car_text": "#c5902e",
    "color_label": "#000000",
    "color_custom0": "#f20e40",
    "color_custom0_text": "#f20e40",
    "color_custom1": "#f20e40",
    "color_custom1_text": "#f20e40",
    "color_custom2": "#f20e40",
    "color_custom2_text": "#f20e40",
    "color_custom3": "#f20e40",
    "color_custom3_text": "#f20e40",
    "color_grid": "#61687a",
    "color_grid_text": "#61687a",
    "color_house": "#00b5dd",
    "color_house_text": "#00b5dd",
    "color_lines": "#000000",
    "color_production": "#ffce4a",
    "color_production_text": "#ffce4a",
    "consumption_reverse": false,
    "font": "sans-serif",
    "font_size_label": 12,
    "font_size_percent": 14,
    "font_size_value": 14,
    "font_size_unit": 14,
    "font_size_unit_percent": 14,
    "grid_all_positive": false,
    "grid_reverse": false,
    "line_size": 4,
    "element_type": "circle",
    "rect_height": 100,
    "rect_width": 100,
    "rect_corner": 15,
    "recalculate": false,
    "unit": "kW",
    "fraction": 2,
    "animation_dots": 3,
    "fraction_battery": 0,
    "house_netto": false,
    "label_house": "Verbrauch",
    "label_grid": "Netz",
    "label_battery": "Batterie",
    "label_production": "Erzeugung",
    "label_car": "Auto"
  },
  "objects": [],
  "instanceObjects": []
}
