{
  "common": {
    "name": "energiefluss",
    "version": "3.5.0",
    "news": {
      "3.5.0": {
        "en": "added third production point. If used, the Slim-Design is deactivated (#101)\nAll values can be in W or kW. The adapter converts the values appropriately (#102)\n2 custom elements can now work as a balcony power plant\nproduction can be configured as \"No feed-in\" (line will not be drawn)",
        "de": "dritte Produktionsstelle hinzugefügt. Bei Verwendung wird das Slim-Design deaktiviert (#101)\nAlle Werte können in W oder kW liegen. Der Adapter wandelt die Werte entsprechend um (#102)\n2 benutzerdefinierte elemente können jetzt als balkonkraftwerk arbeiten\nproduktion kann als \"keine Einspeisung\" konfiguriert werden (Linie wird nicht gezeichnet)",
        "ru": "добавлена третья точка производства. При использовании деактивируется Slim-Design (#101)\nВсе значения могут быть в W или кВт. Адаптер конвертирует значения соответствующим образом (#102)\n2 пользовательских элемента теперь могут работать как балконная электростанция\nпроизводство может быть настроено как \"Нет фид-ин\" (линия не будет нарисована)",
        "pt": "adicionado terceiro ponto de produção. Se usado, o Slim-Design é desativado (#101)\nTodos os valores podem ser em W ou kW. O adaptador converte os valores apropriadamente (#102)\n2 elementos personalizados agora podem trabalhar como uma planta de energia varanda\na produção pode ser configurada como \"No feed-in\" (linha não será desenhada)",
        "nl": "voegde derde productiepunt toe. Als het gebruikt wordt, wordt de Slim-Design gedeactiveerd\nAlle waarden kunnen in W of KW zijn. De adapter bekert de waarden gepast\n2 gebruikelijke elementen kunnen nu werken als een elektriciteitscentrale\nde productie kan worden in beslag genomen als \"Geen voeding\" (line zal niet getekend worden",
        "fr": "3ème point de production. Si utilisé, le Slim-Design est désactivé (#101)\nToutes les valeurs peuvent être en W ou en kW. L'adaptateur convertit les valeurs de manière appropriée (#102)\n2 éléments personnalisés peuvent maintenant fonctionner comme une centrale de balcon\nla production peut être configurée comme \"Pas d'alimentation\" (la ligne ne sera pas dessinée)",
        "it": "aggiunto terzo punto di produzione. Se utilizzato, lo Slim-Design viene disattivato (#101)\nTutti i valori possono essere in W o kW. L'adattatore converte i valori in modo appropriato (#102)\n2 elementi personalizzati possono ora funzionare come una centrale di potere balcone\nla produzione può essere configurata come \"Nessun feed-in\" (la linea non sarà disegnata)",
        "es": "añadido tercer punto de producción. Si se utiliza, el Slim-Design se desactiva (#101)\nTodos los valores pueden ser en W o kW. El adaptador convierte los valores apropiadamente (#102)\n2 elementos personalizados ahora pueden funcionar como planta de alimentación de balcón\nla producción se puede configurar como \"Ninguna entrada\" (no se dibujará la línea)",
        "pl": "dodano trzeci punkt produkcji. W przypadku użycia Slim-Design jest deaktywowany (#101)\nWszystkie wartości mogą być w W lub KW. Adaptator otrzymuje odpowiednie wartości (#102)\n2 elementy użytkowe mogą teraz działać jako elektrownia balkony\nprodukcję można skonfigurować jako „niepotrzebny” (nie będzie rysowany)",
        "uk": "додано третій виробничий пункт. Якщо використовується, то Slim-Design деактивується (#101)\nВсі значення можуть бути в W або кВт. Адаптер перетворює значення належним чином (#102)\n2 нестандартні елементи тепер можуть працювати як балконна електростанція\nвиробництво може бути налаштований як \"Без корму\" (лінія не буде намальована)",
        "zh-cn": "增加第三个生产点。 如使用,Slim-Design被取消(第101号)。\n所有价值观都可以在W或千瓦。 调整者将适当数值(第102号)改为\n2 习俗分子现在可以作为手艺发电厂开展工作。\n生产可被定性为“无饲料”(不拟)"
      },
      "3.4.0": {
        "en": "not translated",
        "de": "not translated",
        "ru": "not translated",
        "pt": "not translated",
        "nl": "not translated",
        "fr": "not translated",
        "it": "not translated",
        "es": "not translated",
        "pl": "not translated",
        "uk": "not translated",
        "zh-cn": "not translated"
      },
      "3.3.1": {
        "en": "fixed versioning",
        "de": "feste version",
        "ru": "фиксированная версия",
        "pt": "versão fixa",
        "nl": "vertaling:",
        "fr": "version fixe",
        "it": "versione fissa",
        "es": "versión fija",
        "pl": "wersja stała",
        "uk": "фіксована версія",
        "zh-cn": "固定版本"
      },
      "3.3.0": {
        "en": "define shadows for text, value, percent and icon\nhide lines, if no animation is present on the line\npossibility, to add a second value and description for e.g. daily summary (colors can be defined too) to production, additional production, consumption and grid. Swap time can be defined and clicking on an element will change the values and descriptions one time and will return to the timer afterwards\nautomatic speed of animation can be used to easily identify the highest consumption within custom elements 1 to 11. Highest consumption will use the speed of the animation, lower consumptions will use the multiplicator of +1000 of the defined animation speed\nadded Wiki Link to admin\nupdated translations\nsome additional background changes for adding adapter to iobroker repository",
        "de": "schatten für text, wert, prozent und symbol definieren\nversteckte linien, wenn keine animation auf der linie vorhanden ist\nmöglichkeit, einen zweiten Wert und eine Beschreibung für z.B. tägliche Zusammenfassung (Farben können auch definiert werden) zur Produktion, zusätzliche Produktion, Verbrauch und Gitter hinzuzufügen. Swap-Zeit kann definiert werden und ein Klick auf ein Element ändert die Werte und Beschreibungen einmal und wird danach zum Timer zurückkehren\nautomatische Animationsgeschwindigkeit kann verwendet werden, um den höchsten Verbrauch innerhalb der benutzerdefinierten Elemente 1 bis 11 leicht zu identifizieren. Höchster Verbrauch wird die Geschwindigkeit der Animation verwenden, niedriger Verbrauch wird den Multiplikator von +1000 der definierten Animationsgeschwindigkeit verwenden\nwiki Link zu admin\naktualisierung der übersetzungen\neinige zusätzliche hintergrundänderungen für das hinzufügen von adapter zu iobroker repository",
        "ru": "определить тени для текста, ценности, процентов и иконки\nскрыть линии, если не анимация присутствует на линии\nвозможность, добавить второе значение и описание для е.г ежедневное резюме (цветы могут быть определены также) для производства, дополнительного производства, потребления и сетки. Время свопа может быть определено и нажав на элемент изменит значения и описания один раз и вернется к таймеру после\nавтоматическая скорость анимации может быть использована для легкого определения самого высокого потребления в пределах пользовательских элементов 1 до 11. Самое высокое потребление будет использовать скорость анимации, более низкие потребление будет использовать умножитель +1000 определенной скорости анимации\nдобавил Wiki Link в админ\nобновленные переводы\nнекоторые дополнительные изменения фона для добавления адаптера к iobroker repository",
        "pt": "definir sombras para texto, valor, porcentagem e ícone\nesconder linhas, se nenhuma animação está presente na linha\npossibilidade, adicionar um segundo valor e descrição para, por exemplo, resumo diário (as cores também podem ser definidas) para a produção, produção adicional, consumo e grade. O tempo de troca pode ser definido e clicar em um elemento irá alterar os valores e descrições uma vez e voltará ao temporizador depois\nvelocidade automática de animação pode ser usado para identificar facilmente o consumo mais alto dentro de elementos personalizados 1 a 11. O consumo mais alto usará a velocidade da animação, menores consumos usarão o multiplicador de +1000 da velocidade de animação definida\nadicionado Wiki Link para admin\ntraduções atualizadas\nalgumas alterações de fundo adicionais para adicionar adaptador ao repositório iobroker",
        "nl": "definieer schaduw voor tekst, waarde, percent en icon\nverberglijnen, als er geen animatie aanwezig is op de lijn\nmogelijk, om een tweede waarde en beschrijving toe te voegen voor E.G. dagelijkse samenvatting (kleuren kan ook gedefinieerd worden aan productie, extra productie, consumptie en grid. De wisseltijd kan worden gedefinieerd en geklikt op een element zal de waarden en beschrijvingen een keer veranderen en daarna terugkeren naar de timer\nautomatische snelheid van animatie kan gemakkelijk gebruikt worden om de hoogste consumptie te identificeren binnen de elementen 1 tot 11. Hoogste consumptie zal de snelheid van de animatie gebruiken, de lagere consumpties zullen de multiplicator van +1000 van de gedefinieerde animatiesnelheid gebruiken\nvoegde Wiki Link toe aan administratie\nvertaling:\nwat extra achtergrondverandering voor het toevoegen van de iobroker herberg",
        "fr": "définir les ombres pour le texte, la valeur, le pourcentage et l'icône\ncacher des lignes, si aucune animation n'est présente sur la ligne\npossibilité d'ajouter une deuxième valeur et une description pour par exemple un résumé quotidien (les couleurs peuvent être définies aussi) à la production, production supplémentaire, consommation et grille. Le temps d'enroulement peut être défini et cliquer sur un élément changera les valeurs et les descriptions une fois et retournera au timer après\nla vitesse d'animation automatique peut être utilisée pour identifier facilement la plus grande consommation dans les éléments personnalisés 1 à 11. La consommation la plus élevée utilisera la vitesse de l'animation, les consommations inférieures utiliseront le multiplicateur de +1000 de la vitesse d'animation définie\najouté Wiki Lien pour admin\ntraductions mises à jour\nquelques changements de fond supplémentaires pour ajouter l'adaptateur au dépôt iobroker",
        "it": "definire ombre per testo, valore, per cento e icona\nnascondere le linee, se nessuna animazione è presente sulla linea\npossibilità, di aggiungere un secondo valore e descrizione per esempio il riepilogo giornaliero (i colori possono essere definiti anche) alla produzione, produzione aggiuntiva, consumo e griglia. Il tempo di swap può essere definito e cliccando su un elemento cambierà i valori e le descrizioni una volta e tornerà al timer dopo\nvelocità automatica di animazione può essere utilizzato per identificare facilmente il consumo più alto all'interno di elementi personalizzati da 1 a 11. Il consumo più elevato userà la velocità dell'animazione, i consumi più bassi useranno il moltiplicatore di +1000 della velocità di animazione definita\naggiunto Wiki Link a admin\ntraduzioni aggiornate\nalcune modifiche di sfondo aggiuntive per l'aggiunta di adattatore al repository iobroker",
        "es": "definir sombras para texto, valor, porcentaje e icono\nescondite líneas, si no hay animación presente en la línea\nposibilidad, añadir un segundo valor y descripción para, por ejemplo, resumen diario (los colores pueden definirse también) a la producción, producción adicional, consumo y rejilla. El tiempo de intercambio se puede definir y hacer clic en un elemento cambiará los valores y descripciones una vez y volverá al temporizador después\nla velocidad automática de la animación se puede utilizar para identificar fácilmente el consumo más alto dentro de los elementos personalizados 1 a 11. Consumo más alto utilizará la velocidad de la animación, menor consumo utilizará el multiplicador de +1000 de la velocidad de animación definida\nwiki Enlace a admin\ntraducciones actualizadas\nalgunos cambios de fondo adicionales para añadir adaptador a iobroker repository",
        "pl": "określa cień dla tekstu, wartości, procent i ikon\nukrycia, jeśli animacja nie jest obecna na linii\nmożliwość dodawania drugiej wartości i opisu dla e.g daily summary (kolory mogą być również zdefiniowane) do produkcji, dodatkowej produkcji, konsumpcji i sieci. Czas Swapa można zdefiniować i kliknąć na elementu zmieniają wartości i opisy czasu, a następnie wracają do czasu\nszybkość animacji można łatwo zidentyfikować najwyższą konsumpcję w elementach 1 do 11. Najwyższy zużycie wykorzystuje szybkość animacji, niższe konsumpcje będą korzystać z mnożnika +1000 zdefiniowanej prędkości animacji\ndodano do niej Wiki Link\ntłumaczenia aktualizowane\nkolejne zmiany tła do dodawania adapter do repozytorium iobroker",
        "uk": "визначення тіней для тексту, значення, відсотка та іконки\nприховати лінії, якщо немає анімації на лінії\nможливість, щоб додати другий значення і опис для наприклад, щоденного резюме (кольори можуть бути визначені занадто) до виробництва, додаткового виробництва, споживання і сітки. Час повернення може бути визначений і натискаючи на елемент зміни значень і описів одночасно і повернеться до таймера після\nавтоматична швидкість анімації може бути використана для легкого виявлення найвищого споживання в межах користувацьких елементів 1 до 11. Найвище споживання буде використовувати швидкість анімації, нижчі витрати будуть використовувати мультиплікатор +1000 виділеної швидкості анімації\nдодано Wiki Link до адміністратора\nоновлені переклади\nдеякі додаткові фонові зміни для додавання адаптера в iobroker репозиторію",
        "zh-cn": "界定案文的阴影、价值、4%和icon\n隐瞒线,如果没有朝线进行任何破坏。\n有可能在生产、增加生产、消费和电网等方面增加第二值和说明,例如每日总表(可以界定过谁)。 时间可以确定和点击一个因素,这将改变价值和描述,并将回到后方。\n可以用自动推断速度来轻易地查明习俗要素1至11中的最高消费。 最高消费将使用降水的速度,减少消费将使用10 000美元的多倍的会议速度。\n增加Wiki的联系,以防急\n最新翻译\nb. 增加适应者加入碘化器的一些其他背景变化"
      },
      "3.2.0": {
        "en": "added second production element\ntranslation fixes\nbasic data updated\nremoved some testing waste",
        "de": "zweites produktionselement\nübersetzungskorrekturen\nbasisdaten aktualisiert\nentfernte testmüll",
        "ru": "добавлен второй элемент производства\nисправления перевода\nосновные данные обновлены\nудалить некоторые испытания отходов",
        "pt": "adicionado segundo elemento de produção\ncorreções de tradução\ndados básicos atualizados\nremoveu alguns resíduos de testes",
        "nl": "tweede productie element\nvertaling\nbasic gegevens geüpdateerd\nverwijder wat testafval",
        "fr": "deuxième élément de production\ntraduction\ndonnées de base mises à jour\ndes déchets d ' essai",
        "it": "aggiunto secondo elemento di produzione\ncorrezioni di traduzione\ndati di base aggiornati\nrimosso alcuni rifiuti di prova",
        "es": "segundo elemento de producción\ntraducción correcciones\ndatos básicos actualizados\nse eliminaron algunos desechos de prueba",
        "pl": "dodanie drugiego elementu produkcyjnego\nnaprawa tłumaczenia\npodstawowa aktualizacja danych\nusunięte testy",
        "uk": "додано другий елемент виробництва\nфіксатори перекладу\nбазові дані оновлені\nвидалення деяких контрольних відходів",
        "zh-cn": "增加的第二个生产要素\n笔译\n更新的基本数据\n拆除一些试验废料"
      },
      "3.1.0": {
        "en": "fixed <br> alignment inside element\nadded new animation types to line-animation\ncleaned up some files for future handling",
        "de": "fest <br> ausrichtung innerhalb des elements\nneue animationstypen zur line-animation hinzugefügt\neinige dateien für zukünftiges handling gereinigt",
        "ru": "фиксированный <br> выравнивание внутри элемента\nдобавлены новые типы анимации в линейную анимацию\nочистить некоторые файлы для будущей обработки",
        "pt": "fixo <br> alinhamento dentro do elemento\nadicionado novos tipos de animação para animação de linha\nlimpou alguns arquivos para manipulação futura",
        "nl": "_\nvoegde nieuwe animatietypes toe aan line-animatie\nik heb wat dossiers opgeruimd voor de toekomst",
        "fr": "alignement horizontal fixe\najout de nouveaux types d'animation à line-animation\nnettoyer certains fichiers pour la manipulation future",
        "it": "allineamento fisso\naggiunto nuovi tipi di animazione alla linea-animazione\npulire alcuni file per la gestione futura",
        "es": "fijada en el elemento interior\nnuevos tipos de animación añadidos a line-animation\nlimpiar algunos archivos para el futuro manejo",
        "pl": "zbiór stałych <br> w dopasowywaniu wewnątrz elementu\ndodano nowe typy animacji do animacji liniowej\nczyścić niektóre pliki dla przyszłej obsługi",
        "uk": "фіксована <br> вирівнювання всередині елемента\nдодано нові типи анімації до лінійно-анімації\nочистити деякі файли для майбутнього обробки",
        "zh-cn": "固定> 要素内的一致性\n增加新的降解类型\n对今后处理的一些档案进行清理"
      },
      "3.0.3": {
        "en": "fixed custom line 9 coloring, which was not working\nadded own state in object browser for remaining accu\nfont size increased for some descriptions in admin panel",
        "de": "feste benutzerdefinierte linie 9 färbung, die nicht funktioniert\nhinzugefügt eigenen zustand im objekt-browser für verbleibenden accu\nschriftgröße erhöht für einige beschreibungen in admin-panel",
        "ru": "фиксированная линия 9 раскраски, которая не работала\nдобавлено собственное состояние в браузере объектов для оставшегося accu\nразмер шрифта увеличен для некоторых описаний в панели админ",
        "pt": "linha personalizada fixa 9 coloração, que não estava funcionando\nadicionado próprio estado no navegador objeto para permanecer accu\ntamanho da fonte aumentou para algumas descrições no painel de admin",
        "nl": "vertaling:\nvoegde eigen staat toe in object browser voor het blijven van beschuldiging\nfont maat verhoogd voor beschrijvingen in administratie",
        "fr": "la ligne 9 fixe, qui ne fonctionnait pas\najouté propre état dans le navigateur objet pour restant accu\ntaille de police augmentée pour certaines descriptions dans le panneau d'administration",
        "it": "fisso personalizzato linea 9 colorazione, che non funzionava\naggiunto proprio stato nel browser oggetto per rimanere accu\ndimensione del carattere aumentata per alcune descrizioni nel pannello di amministrazione",
        "es": "línea fija personalizada 9 para colorear, que no estaba funcionando\nestado añadido en el navegador de objetos para el accu\ntamaño de fuente aumentado para algunas descripciones en el panel de administración",
        "pl": "na bazie stacjonarnej linii 9 kolorów, które nie pracowały\ndodał własny stan przeglądarki obiektowej dla pozostałego przyspieszenia\nrozmiar czcionki wzrósł do niektórych opisów w panelach adminowych",
        "uk": "фіксована замовна лінія 9 розмальовка, яка не працювала\nдодано власний стан в браузері об'єкта для решти accu\nрозмір шрифту збільшено на деякі описи в адмін панелі",
        "zh-cn": "固定的习俗线9:没有工作。\n在剩余的拖车上添加自己的国家\n专案小组的一些说明数量增加"
      }
    },
    "titleLang": {
      "en": "Energiefluss",
      "de": "Energiefluss",
      "ru": "Энергифлусс",
      "pt": "Energiefluss",
      "nl": "Energiefluss",
      "fr": "Energiefluss",
      "it": "Flusso di energia",
      "es": "Energiefluss",
      "pl": "Energiefluss",
      "zh-cn": "精力充沛",
      "uk": "Енергієзлив"
    },
    "desc": {
      "en": "It provides an animated energy-flow for solar-panels, battery-charging, house-consumption, grid feed-in and car-charging.",
      "de": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "ru": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pt": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "nl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung en Auto-Ladung bereit.",
      "fr": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "it": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung beit.",
      "es": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "pl": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit.",
      "zh-cn": "Es stellt einen animierten Energiefluss für Photovoltaik, Batterie, Hausverbrauch, Einspeisung und Auto-Ladung bereit。",
      "uk": "Він забезпечує анімований потік енергії для сонячних панелей, заряджання акумулятора, домашнього споживання, підключення до мережі та заряджання автомобіля."
    },
    "authors": [
      {
        "name": "SKB",
        "email": "info@skb-web.de"
      }
    ],
    "keywords": [
      "energy",
      "energy-flow",
      "energie",
      "energiefluss"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "energiefluss.png",
    "enabled": true,
    "localLinks": {
      "_default": "%web_protocol%://%ip%:%web_port%/energiefluss/index.html?instance=%instance%"
    },
    "extIcon": "https://raw.githubusercontent.com/SKB-CGN/ioBroker.energiefluss/main/admin/energiefluss.png",
    "readme": "https://github.com/SKB-CGN/ioBroker.energiefluss/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "connectionType": "local",
    "dataSource": "assumption",
    "materialize": true,
    "materializeTab": true,
    "adminTab": {
      "singleton": false,
      "name": {
        "en": "Energiefluss",
        "de": "Energiefluss",
        "ru": "Энергифлусс",
        "pt": "Energiefluss",
        "nl": "Energiefluss",
        "fr": "Energiefluss",
        "it": "Flusso di energia",
        "es": "Energiefluss",
        "pl": "Energiefluss",
        "zh-cn": "精力充沛"
      },
      "link": "",
      "fa-icon": "info"
    },
    "supportCustoms": false,
    "dependencies": [
      {
        "js-controller": ">=3.3.22",
        "web": ">=3.0.12"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ]
  },
  "native": {
    "animation": "4 12 4 12 4 100",
    "animation_color_battery_to_house": "",
    "animation_color_grid_to_battery": "",
    "animation_color_grid_to_house": "",
    "animation_color_house_to_custom0": "",
    "animation_color_house_to_custom1": "",
    "animation_color_house_to_custom10": "",
    "animation_color_house_to_custom2": "",
    "animation_color_house_to_custom3": "",
    "animation_color_house_to_custom4": "",
    "animation_color_house_to_custom5": "",
    "animation_color_house_to_custom6": "",
    "animation_color_house_to_custom7": "",
    "animation_color_house_to_custom8": "",
    "animation_color_house_to_custom9": "",
    "animation_color_solar_to_battery": "",
    "animation_color_solar_to_grid": "",
    "animation_color_solar_to_house": "",
    "animation_color_solar0_to_solar": "",
    "animation_color_solar1_to_solar": "",
    "animation_distance": 6,
    "animation_dots": 6,
    "animation_duration": 2000,
    "animation_length": 6,
    "animation_linecap": "round",
    "animation_type": "linear",
    "animation_width": 6,
    "battery_animation": true,
    "battery_capacity": 0,
    "battery_capacity_info": false,
    "battery_charge": "",
    "battery_different": false,
    "battery_discharge": "",
    "battery_percent": "",
    "battery_reverse": false,
    "calculate_consumption": false,
    "car_custom_percent": "",
    "car_custom_plugged": "",
    "car_custom10_percent": "",
    "car_custom10_plugged": "",
    "circle_radius": 50,
    "color_animation": "#ffce4a",
    "color_battery": "#a1d343",
    "color_battery_percent": "#a1d343",
    "color_battery_remain": "#000000",
    "color_battery_text": "#a1d343",
    "color_battery_text_no_prod": "",
    "color_battery_to_house": "",
    "color_car_custom_percent": "#f20e40",
    "color_car_custom_plugged": "#a1d343",
    "color_car_custom10_percent": "#f20e40",
    "color_car_custom10_plugged": "#a1d343",
    "color_custom0": "#f20e40",
    "color_custom0_text": "#f20e40",
    "color_custom0_text_no_prod": "",
    "color_custom1": "#f20e40",
    "color_custom1_text": "#f20e40",
    "color_custom1_text_no_prod": "",
    "color_custom10": "#f20e40",
    "color_custom10_text": "#f20e40",
    "color_custom10_text_no_prod": "",
    "color_custom2": "#f20e40",
    "color_custom2_text": "#f20e40",
    "color_custom2_text_no_prod": "",
    "color_custom3": "#f20e40",
    "color_custom3_text": "#f20e40",
    "color_custom3_text_no_prod": "",
    "color_custom4": "#f20e40",
    "color_custom4_text": "#f20e40",
    "color_custom4_text_no_prod": "",
    "color_custom5": "#f20e40",
    "color_custom5_text": "#f20e40",
    "color_custom5_text_no_prod": "",
    "color_custom6": "#f20e40",
    "color_custom6_text": "#f20e40",
    "color_custom6_text_no_prod": "",
    "color_custom7": "#f20e40",
    "color_custom7_text": "#f20e40",
    "color_custom7_text_no_prod": "",
    "color_custom8": "#f20e40",
    "color_custom8_text": "#f20e40",
    "color_custom8_text_no_prod": "",
    "color_custom9": "#f20e40",
    "color_custom9_text": "#f20e40",
    "color_custom9_text_no_prod": "",
    "color_grid": "#61687a",
    "color_grid_text": "#61687a",
    "color_grid_text_no_prod": "",
    "color_grid_to_battery": "",
    "color_grid_to_house": "",
    "color_house": "#00b5dd",
    "color_house_text": "#00b5dd",
    "color_house_text_no_prod": "",
    "color_house_to_custom0": "",
    "color_house_to_custom1": "",
    "color_house_to_custom10": "",
    "color_house_to_custom2": "",
    "color_house_to_custom3": "",
    "color_house_to_custom4": "",
    "color_house_to_custom5": "",
    "color_house_to_custom6": "",
    "color_house_to_custom7": "",
    "color_house_to_custom8": "",
    "color_house_to_custom9": "",
    "color_icon": "#000000",
    "color_label": "#000000",
    "color_lines": "#000000",
    "color_production": "#ffce4a",
    "color_production0": "#ffce4a",
    "color_production1": "#ffce4a",
    "color_production_text": "#ffce4a",
    "color_production0_text": "#ffce4a",
    "color_production1_text": "#ffce4a",
    "color_production_text_no_prod": "",
    "color_production0_text_no_prod": "",
    "color_production1_text_no_prod": "",
    "color_solar_to_battery": "",
    "color_solar_to_grid": "",
    "color_solar_to_house": "",
    "color_solar0_to_solar": "",
    "color_solar1_to_solar": "",
    "consumption": "",
    "consumption_reverse": false,
    "custom_icon0": "",
    "custom_icon1": "",
    "custom_icon10": "",
    "custom_icon2": "",
    "custom_icon3": "",
    "custom_icon4": "",
    "custom_icon5": "",
    "custom_icon6": "",
    "custom_icon7": "",
    "custom_icon8": "",
    "custom_icon9": "",
    "custom0": "",
    "custom1": "",
    "custom10": "",
    "custom2": "",
    "custom3": "",
    "custom4": "",
    "custom5": "",
    "custom6": "",
    "custom7": "",
    "custom8": "",
    "custom9": "",
    "custom_type": "consumer",
    "custom10_type": "car",
    "element_animation": false,
    "element_animation_time": 5000,
    "element_distance": 15,
    "element_shadow": true,
    "element_shadow_color": "rgba(0, 0, 0, .7)",
    "element_size": 2,
    "element_type": "circle",
    "fill_color_battery": "",
    "fill_color_custom0": "",
    "fill_color_custom1": "",
    "fill_color_custom10": "",
    "fill_color_custom2": "",
    "fill_color_custom3": "",
    "fill_color_custom4": "",
    "fill_color_custom5": "",
    "fill_color_custom6": "",
    "fill_color_custom7": "",
    "fill_color_custom8": "",
    "fill_color_custom9": "",
    "fill_color_grid": "",
    "fill_color_house": "",
    "fill_color_production": "",
    "fill_color_production0": "",
    "fill_color_production1": "",
    "fill_elements": false,
    "font": "sans-serif",
    "font_size_label": 12,
    "font_size_percent": 14,
    "font_size_remaining": 14,
    "font_size_unit": 14,
    "font_size_unit_percent": 14,
    "font_size_value": 14,
    "font_src": "",
    "fraction": 2,
    "fraction_battery": 0,
    "grid_all_positive": false,
    "grid_consuming": "",
    "grid_different": false,
    "grid_feed": "",
    "grid_reverse": false,
    "house_netto_custom0": false,
    "house_netto_custom1": false,
    "house_netto_custom10": false,
    "house_netto_custom2": false,
    "house_netto_custom3": false,
    "house_netto_custom4": false,
    "house_netto_custom5": false,
    "house_netto_custom6": false,
    "house_netto_custom7": false,
    "house_netto_custom8": false,
    "house_netto_custom9": false,
    "label_battery": "Batterie",
    "label_battery_remaining": "Restzeit",
    "label_custom0": "",
    "label_custom1": "",
    "label_custom10": "",
    "label_custom2": "",
    "label_custom3": "",
    "label_custom4": "",
    "label_custom5": "",
    "label_custom6": "",
    "label_custom7": "",
    "label_custom8": "",
    "label_custom9": "",
    "label_grid": "Netz",
    "label_house": "Verbrauch",
    "label_production": "Erzeugung",
    "label_production0": "2. Erzeugung",
    "label_production1": "3. Erzeugung",
    "label_swap_production": "",
    "label_swap_production0": "",
    "label_swap_production1": "",
    "label_swap_consumption": "",
    "label_swap_grid": "",
    "line_size": 6,
    "offset_icon": 0,
    "offset_percent": 0,
    "offset_remaining": 0,
    "offset_text": 0,
    "offset_value": 0,
    "opacity_icon": 70,
    "opacity_line": 70,
    "opacity_percent": 100,
    "opacity_remaining": 70,
    "opacity_text": 70,
    "opacity_value": 100,
    "production": "",
    "production0": "",
    "production1": "",
    "recalculate": false,
    "rect_corner": 15,
    "rect_height": 100,
    "rect_width": 100,
    "slim_design": false,
    "swap_color_production_text": "#ffce4a",
    "swap_color_production0_text": "#ffce4a",
    "swap_color_production1_text": "#ffce4a",
    "swap_color_house_text": "#00b5dd",
    "swap_color_grid_text": "#61687a",
    "swap_production": "",
    "swap_production0": "",
    "swap_production1": "",
    "swap_consumption": "",
    "swap_grid": "",
    "threshold": 0,
    "unit": "W",
    "text_shadow": false,
    "text_shadow_color": "rgba(0, 0, 0, .7)",
    "values_shadow": false,
    "values_shadow_color": "rgba(0, 0, 0, .7)",
    "icons_shadow": false,
    "icons_shadow_color": "rgba(0, 0, 0, .7)",
    "percent_shadow": false,
    "percent_shadow_color": "rgba(0, 0, 0, .7)",
    "disable_icons": false,
    "debounce_percent": 10,
    "custom4_type": "consumer",
    "custom9_type": "consumer",
    "kw_production": false,
    "kw_production0": false,
    "kw_production1": false,
    "kw_consumption": false,
    "kw_grid_feed": false,
    "kw_grid_consuming": false,
    "kw_battery_charge": false,
    "kw_battery_discharge": false,
    "kw_custom0": false,
    "kw_custom1": false,
    "kw_custom2": false,
    "kw_custom3": false,
    "kw_custom4": false,
    "kw_custom5": false,
    "kw_custom6": false,
    "kw_custom7": false,
    "kw_custom8": false,
    "kw_custom9": false,
    "kw_custom10": false,
    "no_feed_in": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "configuration",
      "type": "state",
      "common": {
        "name": "Parameters for HTML Output",
        "type": "string",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "data",
      "type": "state",
      "common": {
        "name": "Data for HTML Output",
        "type": "json",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "battery_remaining",
      "type": "state",
      "common": {
        "name": "Remaining Time of the battery",
        "type": "string",
        "role": "text",
        "read": true,
        "write": false
      },
      "native": {}
    }
  ]
}
